[M_IrisEp4_AMontage MissionDefinition]
MissionName="Research methods"
MissionDescription="With her new endorsement and good work promoting Gladiator, Moxie is getting the attention of men (and not just with her looks). He has a plan for you..."
TurnInDescription="Your manager turned out to be an old friend of Pond Chikitina. That's the "old" part because he's 13. Is the "friends" part still unclear?."
MissionSummary="Meet your new teacher.."
MissionGiver="Don't feel bad"
MissionTurnInLocation="bath"
TeaserText=""

[M_IrisEp4_AMontage:FindTrainer MissionObjectiveDefinition]
ProgressMessage="Meet the new coach"

[M_IrisEp4_AMontage:LeaveBar MissionObjectiveDefinition]
ProgressMessage="Escape from Pyro Pete's Bar"

[M_IrisEp4_AMontage:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_AMontage:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_AMontage:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Moxie is your new sponsor and she is good in your promotion because she likes men (not because of her looks). He hired you as his personal trainer because he thinks you need training to fight high level fighters like Motor Mom and Lame Baron. you must know him."

[M_IrisEp4_AMontage:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_AMontage:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_AMontage:MoxxisBar MissionObjectiveDefinition]
ProgressMessage="Go to Badass Crater Bar"

[M_IrisEp4_AMontage:ReturnToHub MissionObjectiveDefinition]
ProgressMessage="go back to the hole"

[M_IrisEp4_CherryBomb MissionDefinition]
MissionName="light a fire"
MissionDescription="The next tallest fighter in Torg's ranks is called Mother Machine. Hidden inside [place]South Road[-place] And it seems he has met his worst enemy..<br><br>Now he attracts you, you can meet Mi Tsav and seduce him like there is no tomorrow.."
TurnInDescription="Thanks to everyone's efforts, Mother Engine has already started on the path to heaven..<br><br>no kidding. <br><br>this is hell."
MissionSummary="The mother hit the car."
MissionGiver="wash"
MissionTurnInLocation="Moxxi"
TeaserText=""

[M_IrisEp4_CherryBomb:DefeatMotorMama MissionObjectiveDefinition]
ProgressMessage="Turn off the engine mom."

[M_IrisEp4_CherryBomb:EnterRaceway MissionObjectiveDefinition]
ProgressMessage="Go to the racecourse entrance"

[M_IrisEp4_CherryBomb:FakeFindMama MissionObjectiveDefinition]
ProgressMessage="Find Momo Momo"

[M_IrisEp4_CherryBomb:FindMama MissionObjectiveDefinition]
ProgressMessage="I am looking for a motorcycle"

[M_IrisEp4_CherryBomb:FollowWire1 MissionObjectiveDefinition]
ProgressMessage="Locate the power cord"

[M_IrisEp4_CherryBomb:Gatherallplayers MissionObjectiveDefinition]
ProgressMessage="Be prepared to fight"

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_10 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_11 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_12 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_13 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_14 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_15 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_5 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_6 MissionObjectiveSetDefinition]
MissionSummaryOverride="Return to the Moxx website."
MissionDescriptionOverride="With Uncle Motor dead, you are now a Third Class Dark Warrior. Moxie talks about another legendary warrior, Baron Claudius.."

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_8 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:MissionObjectiveSetDefinition_9 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_CherryBomb:PowerUp MissionObjectiveDefinition]
ProgressMessage="Electric door company"

[M_IrisEp4_CherryBomb:SpeekWithMoxie MissionObjectiveDefinition]
ProgressMessage="Come back Moxy."

[M_IrisEp4_TrainningWithTina MissionDefinition]
MissionName="Eat cookies and chips"
MissionDescription="Moxie is your new support. She wants to create the same wall to attract men (not because of her personality). He thinks he needs to learn how to fight the best fighters like Mama Motor and Lame Baron..<br><br>Your new coach is Tina Chichitino, and it looks like she wants you to move to Torgu Arena.."
TurnInDescription="Oatmeal raisin cookies are considered a war crime.."
MissionSummary="But [place]Plus[-place]."
MissionGiver="Tina"
MissionTurnInLocation="war on another level"
TeaserText=""

[M_IrisEp4_TrainningWithTina:BreakIntoArena MissionObjectiveDefinition]
ProgressMessage="to go to war"

[M_IrisEp4_TrainningWithTina:DestroyVending MissionObjectiveDefinition]
ProgressMessage="Destruction of food sources"

[M_IrisEp4_TrainningWithTina:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_TrainningWithTina:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_TrainningWithTina:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride="There is cake."
MissionDescriptionOverride="Moxxi is your new sponsor! He tries to encourage the gladiator; He's good at cheering people up (not just the face). He thinks he should practice dealing with old heroes like Mama Motor and Lame Baron..<br><br>Your new teacher is Tina Chichitina. According to him, the first part of the course is the food: you have to eat a lot of Torge cookies to feed the distributor, and you get to work on stamps.."

[M_IrisEp4_TrainningWithTina:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionSummaryOverride="Cut the dough into pieces."
MissionDescriptionOverride="Moxie is her new god and she knows how to entertain gladiators and charm men. (Just not his face.) He thinks he needs to train to compete with the best players like Mama Tsao and Lem Baron..<br><br>Like Tina, Chiquity should be your new teacher. Eating more Torg Machine chocolate chip cookies will give you the energy to beat the Pistons..<br><br>But something happened after eating the biscuit. Tina noticed that the cookies were not chocolate chips. But Bell. This is one of the trickiest and most popular cookie topping combinations..<br><br>Tina gets angry and asks to destroy the car so that no one eats the husk.."

[M_IrisEp4_TrainningWithTina:MissionObjectiveSetDefinition_6 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisEp4_TrainningWithTina:ReturnToTina MissionObjectiveDefinition]
ProgressMessage="Talk to Tina Sikitina"

[M_IrisEp4_TrainningWithTina:StealCookies MissionObjectiveDefinition]
ProgressMessage="Stealing cookies"

